src/main/resources/xml/accommodationFulfillmentServicePort/searchGuest/searchGuest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:searchGuest>
         <request>
            <!--Optional:-->
            <lastName>?</lastName>
            <!--Optional:-->
            <firstName>?</firstName>
            <!--Optional:-->
            <postalCode>?</postalCode>
            <!--Optional:-->
            <countryCode>?</countryCode>
            <!--Optional:-->
            <searchReservation>?</searchReservation>
         </request>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </acc:searchGuest>
   </soapenv:Body>
</soapenv:Envelope>
